#### StairsComponentConnection Members

---

|  |
| --- |
| StairsComponentConnection Class   Methods   Properties   See Also |

The  StairsComponentConnection  type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method | Dispose | Releases all resources used by the  StairsComponentConnection |
| Public method | Equals | Determines whether the specified  Object  is equal to the current  Object  . (Inherited from  Object  .) |
| Public method | GetHashCode | Serves as a hash function for a particular type. (Inherited from  Object  .) |
| Public method | GetType | Gets the  Type  of the current instance. (Inherited from  Object  .) |
| Public method | ToString | Returns a string that represents the current object. (Inherited from  Object  .) |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | ConnectionType | The connection type of the connected stairs component. |
| Public property | ElementId | The element Id of connected stairs component in the stairs connection. |
| Public property | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
| Public property | PeerConnectionType | The connection type of the peer connected stairs component. |
| Public property | PeerElementId | The element Id of peer connected stairs component in the stairs connection. |

# See Also

StairsComponentConnection Class

Autodesk.Revit.DB.Architecture Namespace